code/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "genre", "quotes", "notes", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "notes" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["notes", "The most grotesque piece of racist trash ever written. Should be banned from all schools."], ["updated_at", "2019-04-24 02:38:15.010663"], ["id", 1]]