code/app/controllers/donors_controller.rb

  def index
    @wishes = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def show
    @donor = Donor.find(params[:id])
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @donor = Donor.find(params[:id])
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @donor = Donor.new(donor_params)

    if @donor.save
---
INSERT INTO "donors" ("name", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Frank Lu"], ["message", "I hope you like this book!"], ["created_at", "2019-04-25 03:32:02.677523"], ["updated_at", "2019-04-25 03:32:02.677523"]]

  def update
    @donor = Donor.find(params[:id])

    if @donor.update(donor_params)
---
SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "donors" SET "message" = ?, "updated_at" = ? WHERE "donors"."id" = ?  [["message", "this is yet another test complete :)"], ["updated_at", "2019-04-25 04:09:20.677423"], ["id", 5]]