code/app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def show
    @wish = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @wish = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @wish = Wish.new(wish_params)

    if @wish.save
---
INSERT INTO "wishes" ("title", "author", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Odyssey"], ["author", "Homer"], ["details", "This is one of my favorite books."], ["created_at", "2019-04-24 21:48:29.281555"], ["updated_at", "2019-04-24 21:48:29.281555"]]

  def update
    @wish = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]